doc/html/01-introducao.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 22:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introdução</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Introdução</h1>
<p>
Programação   pode  ser   considerada  um   trabalho  majoritariamente
artesanal.   Mas uma  consideração como  essa não  é adotada  de forma
predominante; longe disso, torna-se algo  digno de debate, e deixa uma
margem para uma interessante troca de opiniões divergentes. Há aqueles
que pensem  no ato  de escrever  um programa  de computador  como algo
mecânico  em princípio:  existiria um  quê de  criatividade, já  que o
programador precisa  tomar as melhores  decisões do ponto de  vista do
projeto de <i>software</i>; Mas, para tal, enumera-se ferramentas e processos
que o auxiliam com planejamento e que, muitas vezes, acabam apontando,
sem  auxílio de  ``intuição'', o  melhor caminho  a ser  seguido nesse
processo criativo.
</p>

<p>
Apesar  de  ver  a  pertinência  do uso  desses  processos  (como  nos
apresenta a disciplina de <i>Engenharia  de Software</i>, por exemplo), ainda
acredito  na  programação de  computadores  como  uma <i>arte</i>,  algo  que
envolve muito mais que apenas seguir práticas consolidadas.
</p>

<p>
Verna (2018, p.  4)   endossa  o  aspecto   artístico  na
programação  &#x2013;  que,  por  alguns, é  considerado  mera  luxúria  &#x2013;,
inclusive  citando  antigos  apoiadores  dessas  ideias  (como  Knuth,
Dijkstra  e   Ershov).  Esses  pensadores  ilustres   também  buscavam
clarificar que a descrição de um programa de computador envolve noções
intrínsecas de <i>estética</i>, <i>beleza</i>, <i>estilo</i>, <i>prazer</i> e <i>emoção</i>, que tendem a
pender muito mais para o lado artístico que o científico.
</p>

<p>
Penso na  escrita de um código  de programação como sendo  um processo
muito  similar à  boa  escrita  em prosa  de  qualquer  outro tipo  de
texto. O objetivo do autor é fazer-se entender através do que escreve;
para tanto,  é imperativo  que palavras,  orações e  demais expressões
gramaticais sejam ordenadas  de forma inteligível, e  o melhor recurso
para garantir  que o  leitor compreenda  o texto  escrito é  a própria
leitura do mesmo, especialmente quando é feita por parte do autor.
</p>

<p>
Ao escrevermos um programa de computador, realizamos um processo muito
similar à composição ou redação. A escrita do código acaba, no fim das
contas,  por envolver  três  leitores: o  <i>próprio  autor</i>, um  eventual
<i>futuro leitor</i>  do código e a  <i>máquina</i> em si (leia-se,  o compilador ou
interpretador, que fica efetivamente responsável por ``compreender'' o
código em questão e transformá-lo em linguagem de máquina).
</p>

<p>
O ``leitor''  mais fácil de  agradar neste trio  é a <i>máquina</i>,  que não
reclamará  de  aspectos  como  a  estética  do  código,  salvo  quando
programas como <i>linters</i> forçarem um certo estilo de escrita no processo
de  programação.   Porém, a  <i>máquina</i>  ainda  está suscetível  a  erros
gramaticais  ou  de  interpretação, provenientes  de  deficiências  na
escrita do código: estes poderão ocasionar tanto erros que antecedem a
execução  (quando  tratarem-se  de  código  sintaticamente  inválido),
quanto a execução de algo  não-pretendido pelo programador (sendo este
o caso do erro de semântica).
</p>

<p>
Aqui entra em ação outro potencial  leitor do código: o próprio <i>autor</i>,
o programador daquele segmento de  código em si. O programador precisa
verificar o código por erros, e  também precisa criar correções.  Se a
forma  como o  código  foi  escrito não  facilita  o próprio  trabalho
daquele que  o escreveu, então é  sinal de que é  necessário revisar a
forma como o  mesmo foi escrito. Escrever código  sem preocupar-se com
estética  ou beleza  é  um  erro comum  de  muitos programadores,  que
costumam  ignorá-lo   por  não   representar  um  problema   em  curto
prazo. Mas, se aquele código precisar ser revisitado após algum tempo,
o  programador  será o  primeiro  a  sofrer  com as  consequências  da
ilegibilidade e/ou desorganização do próprio trabalho.
</p>

<p>
Por fim, temos o último tipo de leitor: o <i>futuro leitor</i> do código, que
normalmente  seria um  terceiro; mas  poderíamos pensar  até mesmo  no
programador original, passado um bom tempo  desde a última vez que viu
o  código:   aos  seus  olhos,   o  programa  ter-se-á   tornado  algo
completamente desconhecido&#x2026; um alienígena.
</p>

<p>
Precisamos pensar  no código como  uma ferramenta <i>didática</i>.   O código
precisa  ser dotado  de  uma simplicidade  autoexplicativa.  O  <i>futuro
leitor</i>  precisará  consertar  algo  no mesmo  ou  adicionar  uma  nova
funcionalidade; para tanto, a forma de escrever o código será o melhor
guia para deixá-lo a par dos  passos a serem tomados, ou dos processos
a  serem   seguidos  para  adicionar,  remover   ou  modificar  certas
operações.
</p>

<p>
No  espírito  deste  <i>aspecto  didático</i> do  código,  que  requer  certa
elegância e  senso de beleza, é  que escrevo este pequeno  <i>software</i> em
formato  de  livro.  Escrever  o interpretador  de  uma  linguagem  de
programação  e definir  a  especificação  da mesma  não  é uma  tarefa
trivial,  mas é  uma tarefa  <i>tangível</i>.  Para provar  esse argumento  e
também  para encorajar  outros  programadores  a utilizarem-se  dessas
ideias,  detalho   passo-a-passo  todo   o  raciocínio  por   trás  do
planejamento para que se conceba  uma linguagem de programação &#x2013; como
um caso especial, uma linguagem que seja um dialeto de Lisp.
</p>

<p>
A intenção não é apresentar um  produto que seja extremamente polido e
que não possa ser modificado  posteriormente; antes, o <i>software</i>, assim
como  qualquer  outro  texto,  é  algo  <i>vivo</i>,  e  pode  inclusive  ser
modificado,  melhorado   ou  até   mesmo  ``traduzido''   para  outras
linguagens.   Por isso,  trabalho  sob alguns  pressupostos, que  mais
tarde enumerarei,  e que  segui como regras  informais de  estilo para
esse processo de desenvolvimento.
</p>

<div id="outline-container-org32ec27e" class="outline-2">
<h2 id="org32ec27e">Bibliografia</h2>
<div class="outline-text-2" id="text-org32ec27e">
<p>

</p>

<p>
Didier Verna (2018). <i>{Lisp}, {Jazz}, {Aikido}</i>, The Art, Science, and Engineering of Programming.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 22:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
